app/controllers/cats_controller.rb

    def show
        @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE (new_cat_url) LIMIT $1  [["LIMIT", 1]]